app/controllers/games_controller.rb

SELECT "games".* FROM "games" WHERE (name ILIKE '%#{search}%')
---
  def index
    if params[:search]
      @games = Game.search(params[:search])

INSERT INTO "games" ("name", "console_id", "developer", "publisher", "release_year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @game = Game.new(game_params)
    if @game.save

SELECT "games".* FROM "games" WHERE "games"."console_id" = $1  [["console_id", 1]]
---
  def xbox_one
    @games = Game.where(console_id: 1)

SELECT "games".* FROM "games" WHERE "games"."console_id" = $1  [["console_id", 2]]
---
  def wiiu
    @games = Game.where(console_id: 2)

SELECT "games".* FROM "games" WHERE "games"."console_id" = $1  [["console_id", 3]]
---
  def wii
    @games = Game.where(console_id: 3)

SELECT "games".* FROM "games" WHERE "games"."console_id" = $1  [["console_id", 4]]
---
  def xbox_360
    @games = Game.where(console_id: 4)

SELECT "games".* FROM "games" WHERE "games"."console_id" = $1  [["console_id", 5]]
---
  def xbox
    @games = Game.where(console_id: 5)

SELECT "games".* FROM "games" WHERE "games"."console_id" = $1  [["console_id", 6]]
---
  def gcn
    @games = Game.where(console_id: 6)

SELECT "games".* FROM "games" WHERE "games"."console_id" = $1  [["console_id", 7]]
---
  def ps2
    @games = Game.where(console_id: 7)

SELECT "games".* FROM "games" WHERE "games"."console_id" = $1  [["console_id", 8]]
---
  def n64
    @games = Game.where(console_id: 8)

SELECT "games".* FROM "games" WHERE "games"."console_id" = $1  [["console_id", 9]]
---
  def ps1
    @games = Game.where(console_id: 9)

SELECT "games".* FROM "games" WHERE "games"."console_id" = $1  [["console_id", 10]]
---
  def saturn
    @games = Game.where(console_id: 10)

SELECT "games".* FROM "games" WHERE "games"."console_id" = $1  [["console_id", 11]]
---
  def snes
    @games = Game.where(console_id: 11)

SELECT "games".* FROM "games" WHERE "games"."console_id" = $1  [["console_id", 12]]
---
  def genesis
    @games = Game.where(console_id: 12)

SELECT "games".* FROM "games" WHERE "games"."console_id" = $1  [["console_id", 13]]
---
  def nes
    @games = Game.where(console_id: 13)

SELECT "games".* FROM "games" WHERE "games"."console_id" = $1  [["console_id", 14]]
---
  def pc
    @games = Game.where(console_id: 14)